systec-electronic/yocto-sysworxx/generic/ecucore-am62x_4594-1.syscfg
iOLDI1.A3P.$used                   = false;
iOLDI1.A4N.$assign                 = "OLDI0_A4N";
iOLDI1.A4N.$used                   = false;
iOLDI1.A4P.$assign                 = "OLDI0_A4P";
iOLDI1.A4P.$used                   = false;
iOLDI1.A5N.$assign                 = "OLDI0_A5N";
iOLDI1.A5N.$used                   = false;
iOLDI1.A5P.$assign                 = "OLDI0_A5P";
iOLDI1.A5P.$used                   = false;
iOLDI1.A6N.$assign                 = "OLDI0_A6N";
iOLDI1.A6N.$used                   = false;
iOLDI1.A6P.$assign                 = "OLDI0_A6P";
iOLDI1.A6P.$used                   = false;
iOLDI1.A7N.$assign                 = "OLDI0_A7N";
iOLDI1.A7N.$used                   = false;
iOLDI1.A7P.$assign                 = "OLDI0_A7P";
iOLDI1.A7P.$used                   = false;
iOLDI1.CLK0N.$assign               = "OLDI0_CLK0N";
iOLDI1.CLK0P.$assign               = "OLDI0_CLK0P";
iOLDI1.CLK1N.$assign               = "OLDI0_CLK1N";
iOLDI1.CLK1N.$used                 = false;
iOLDI1.CLK1P.$assign               = "OLDI0_CLK1P";
iOLDI1.CLK1P.$used                 = false;
const iRGMII1                      = scripting.addPeripheral("RGMII");
iRGMII1.$name                      = "RGMII1";
iRGMII1.$assign                    = "RGMII1";
iRGMII1.$assignVoltage             = "3.3 V";
iRGMII1.RD0.$assign                = "RGMII1_RD0";
iRGMII1.RD1.$assign                = "RGMII1_RD1";
iRGMII1.RD2.$assign                = "RGMII1_RD2";
iRGMII1.RD3.$assign                = "RGMII1_RD3";
iRGMII1.RXC.$assign                = "RGMII1_RXC";
iRGMII1.RX_CTL.$assign             = "RGMII1_RX_CTL";
iRGMII1.TD0.$assign                = "RGMII1_TD0";
iRGMII1.TD1.$assign                = "RGMII1_TD1";
iRGMII1.TD2.$assign                = "RGMII1_TD2";
iRGMII1.TD3.$assign                = "RGMII1_TD3";
iRGMII1.TXC.$assign                = "RGMII1_TXC";
iRGMII1.TX_CTL.$assign             = "RGMII1_TX_CTL";
const iRGMII2                      = scripting.addPeripheral("RGMII");
iRGMII2.$name                      = "RGMII2";
iRGMII2.$assign                    = "RGMII2";
iRGMII2.$assignVoltage             = "3.3 V";
iRGMII2.RD0.$assign                = "RGMII2_RD0";
iRGMII2.RD1.$assign                = "RGMII2_RD1";
iRGMII2.RD2.$assign                = "RGMII2_RD2";
iRGMII2.RD3.$assign                = "RGMII2_RD3";
iRGMII2.RXC.$assign                = "RGMII2_RXC";
iRGMII2.RX_CTL.$assign             = "RGMII2_RX_CTL";
iRGMII2.TD0.$assign                = "RGMII2_TD0";
iRGMII2.TD1.$assign                = "RGMII2_TD1";
iRGMII2.TD2.$assign                = "RGMII2_TD2";
iRGMII2.TD3.$assign                = "RGMII2_TD3";
iRGMII2.TXC.$assign                = "RGMII2_TXC";
iRGMII2.TX_CTL.$assign             = "RGMII2_TX_CTL";
const iSPI1                        = scripting.addPeripheral("SPI");
iSPI1.$useCase                     = "SPI_1";
iSPI1.$name                        = "SPI0";
iSPI1.$assign                      = "SPI0";
iSPI1.$assignVoltage               = "3.3 V";
iSPI1.CLK.$assign                  = "SPI0_CLK";
iSPI1.D0.$assign                   = "SPI0_D0";
iSPI1.D1.$assign                   = "SPI0_D1";
iSPI1.CS0.$assign                  = "SPI0_CS0";
iSPI1.CS0.$used                    = false;
const iSPI2                        = scripting.addPeripheral("SPI");
iSPI2.$useCase                     = "SPI_1";
iSPI2.$name                        = "SPI1";
iSPI2.$assign                      = "SPI1";
iSPI2.$assignVoltage               = "3.3 V";
iSPI2.CLK.$assign                  = "OSPI0_D5";
iSPI2.D0.$assign                   = "OSPI0_D6";
iSPI2.D1.$assign                   = "OSPI0_D7";
iSPI2.CS0.$assign                  = "OSPI0_D4";
iSPI2.CS0.$used                    = false;
const iSYSTEM1                     = scripting.addPeripheral("SYSTEM");
iSYSTEM1.$name                     = "SYSTEM0";
iSYSTEM1.$assign                   = "SYSTEM0";
iSYSTEM1.$assignVoltage            = "3.3 V";
iSYSTEM1.CLKOUT0.$assign           = "EXT_REFCLK1";
iSYSTEM1.CLKOUT0.$used             = true;
iSYSTEM1.EXTINTn.$assign           = "EXTINTn";
iSYSTEM1.EXTINTn.$used             = true;
iSYSTEM1.PORz_OUT.$assign          = "PORz_OUT";
iSYSTEM1.RESETSTATz.$assign        = "RESETSTATz";
iSYSTEM1.RESET_REQz.$assign        = "RESET_REQz";
const iUART1                       = scripting.addPeripheral("UART");
iUART1.$useCase                    = "UART_5";
iUART1.$name                       = "UART0-Service";
iUART1.$assign                     = "USART0";
iUART1.$assignVoltage              = "3.3 V";
iUART1.RXD.$assign                 = "UART0_RXD";
iUART1.TXD.$assign                 = "UART0_TXD";
const iUART2                       = scripting.addPeripheral("UART");
iUART2.$useCase                    = "UART_2";
iUART2.$name                       = "UART1-RESERVED";
iUART2.$assign                     = "USART1";
iUART2.$assignVoltage              = "3.3 V";
iUART2.RXD.$assign                 = "MCASP0_AFSR";
iUART2.TXD.$assign                 = "MCASP0_ACLKR";
iUART2.CTSn.$assign                = "MCASP0_AXR3";
iUART2.RTSn.$assign                = "MCASP0_AXR2";
const iUART3                       = scripting.addPeripheral("UART");
iUART3.$useCase                    = "UART_2";
iUART3.$name                       = "UART5-SERIAL1";
iUART3.$assign                     = "USART5";
iUART3.$assignVoltage              = "3.3 V";
iUART3.RXD.$assign                 = "OSPI0_CSn2";
iUART3.TXD.$assign                 = "OSPI0_CSn3";
iUART3.CTSn.$assign                = "OSPI0_DQS";
iUART3.RTSn.$assign                = "OSPI0_LBCLKO";
const iUART4                       = scripting.addPeripheral("UART");
iUART4.$useCase                    = "UART_2";
iUART4.$name                       = "UART6-SERIAL2";
iUART4.$assign                     = "USART6";
iUART4.$assignVoltage              = "3.3 V";
iUART4.RXD.$assign                 = "VOUT0_DATA8";
iUART4.TXD.$assign                 = "VOUT0_DATA9";
iUART4.CTSn.$assign                = "VOUT0_DATA11";
iUART4.RTSn.$assign                = "VOUT0_DATA10";
const iUART5                       = scripting.addPeripheral("UART");
iUART5.$useCase                    = "UART_5";
iUART5.$name                       = "UART4-SERIAL0";
iUART5.$assign                     = "USART4";
iUART5.$assignVoltage              = "3.3 V";
iUART5.RXD.$assign                 = "VOUT0_DATA4";
iUART5.TXD.$assign                 = "VOUT0_DATA5";
const iUSB1                        = scripting.addPeripheral("USB");
iUSB1.$name                        = "USB0";
iUSB1.$assign                      = "USB0";
iUSB1.$assignVoltage               = "3.3 V";
iUSB1.DM.$assign                   = "USB0_DM";
iUSB1.DP.$assign                   = "USB0_DP";
iUSB1.DRVVBUS.$assign              = "USB0_DRVVBUS";
iUSB1.RCALIB.$assign               = "USB0_RCALIB";
iUSB1.VBUS.$assign                 = "USB0_VBUS";
const iUSB2                        = scripting.addPeripheral("USB");
iUSB2.$name                        = "USB1";
iUSB2.$assign                      = "USB1";
iUSB2.$assignVoltage               = "3.3 V";
iUSB2.DM.$assign                   = "USB1_DM";
iUSB2.DP.$assign                   = "USB1_DP";
iUSB2.DRVVBUS.$assign              = "USB1_DRVVBUS";
iUSB2.RCALIB.$assign               = "USB1_RCALIB";
iUSB2.VBUS.$assign                 = "USB1_VBUS";
const iWKUP_SYSTEM1                = scripting.addPeripheral("WKUP_SYSTEM");
iWKUP_SYSTEM1.$name                = "WKUP_SYSTEM";
iWKUP_SYSTEM1.$assign              = "WKUP_SYSTEM";
iWKUP_SYSTEM1.$assignVoltage       = "3.3 V";
iWKUP_SYSTEM1.WKUP_CLKOUT0.$assign = "WKUP_CLKOUT0";
iWKUP_SYSTEM1.PMIC_LPM_EN0.$used   = false;
const iWKUP_UART1                  = scripting.addPeripheral("WKUP_UART");
iWKUP_UART1.$name                  = "WKUP_UART1-RESERVED";
iWKUP_UART1.$assign                = "WKUP_USART0";
iWKUP_UART1.$assignVoltage         = "3.3 V";
iWKUP_UART1.CTSn.$assign           = "WKUP_UART0_CTSn";
iWKUP_UART1.RTSn.$assign           = "WKUP_UART0_RTSn";
iWKUP_UART1.RXD.$assign            = "WKUP_UART0_RXD";
iWKUP_UART1.TXD.$assign            = "WKUP_UART0_TXD";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
iEPWM1.A.$suggestSolution = "<error>";
